app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name") VALUES ($1, $2) RETURNING "id"  [["first_name", "Laura "], ["last_name", "wadden"]]